#include <stdio.h> //stdio.h **입·출력 함수가 포함.
//** include - 포함하다, ~을 포함시키다



//** main - "함수" 라고 하고, 하나의 프로젝트 당 하나씩만 존재할 수 있다.
int main()
{
	//** printf_s()-출력 명령.
	printf_s("Hello World !! \n");

	//** [\n] - 줄바꿈
	//** [%d] - 정수 출력
	//** [%f] - 실수 출력


	//** () - 소괄호
	//** {} - 중괄호
	//** [] - 대괄호


	//** [;] - 세미콜론 - (명령줄의 마지막을 컴파일러에게 알려줌.)
	//** [:] - 콜론 (c++ 때 많이 사용.)


	//** [&] - and 연산자 
	//** [|] - or  연산자  \ 쉬프트
	//** [^] - xor 연산자
	//** [!] - not 연산자
	//** ['] - 작은 따옴표 ( 문자 표현 )
	//** ["] - 큰 따옴표   (문자열 표현)

	//** [,] - 콤마
	//** [.] - 닷


	//** [&] - (엠퍼센트)
	//** [*] - (에스터리스크)

	/*******************************************************
		*콘솔 창 유지 방법*

		1. 솔루션 탐색시 프로젝트 메뉴에서 [우클릭] 후
			가장 아래쪽에 속성 클릭.

		2. 새로운 윈도우 창에서 링커 메뉴 옆 [삼각형] 클릭.

		3. 링커 메뉴 아래로 나오는 추가 메뉴 중 [시스템] 클릭

		4. 우측에 새로운 창이 활성화 되고, 가장 상단에 [하위 시스템] 클릭

		5. 가장 우측에 아래쪽 화살표 클릭 후 콘솔 메뉴 선택.

		6. 확인. (설정 완료)

		[Ctrl + Shift + B] - 빌드
		[Ctrl + F5 ] - 빌드 후 실행

		http : //indevgame.tistory.com

	*******************************************************/
	
 

	return 0;
}